FemDesign.Materials.Material
material_type

FemDesign.Materials.Material.Name
Name of Material.

FemDesign.Materials.Material.ConcreteMaterialProperties(FemDesign.Materials.Material,System.Double,System.Double,System.Double,System.Double,System.Double)
Set creep and shrinkage parameters to a concrete Material.
material: Material.
creepUls: Creep ULS.
creepSlq: Creep SLS Quasi-Permanent
creepSlf: Creep SLS Frequent
creepSlc: Creep SLS Characteristic
shrinkage: Shrinkage.
Returns: